#+TITLE: RF-Explorer Example Three

* Description
  This is a variation on example one that dumps the entire spectrum instead of just the peak.

* Tangle

#+BEGIN_SRC ipython :session example3 :tangle example_3.py
<<imports>>

<<main>>
<<setup-communicator>>
<<setup-loop>>
<<process-string>>
<<print-data>>
<<end-main>>

<<executable-block>>
#+END_SRC

* Imports
#+BEGIN_SRC ipython :session example3 :results none :noweb-ref imports
# python standard library
from datetime import datetime, timedelta

# from this package
from example_1 import (
    argument_parser,
    Communicator,
    )
#+END_SRC

* The Main processing loop

#+BEGIN_SRC ipython :session example3 :results none :noweb-ref main
def main(arguments, communicator):
    """Runs the example

    Args:
     arguments (argparse.Namespace): object with the settings
     communicator (Communicator): object with the RFECommunicator
    """
    rf_explorer = communicator.rf_explorer
    try:
#+END_SRC

** Setup the Communicator
   This tells the communicator to do the basic setup.

#+BEGIN_SRC ipython :session example3 :results none :noweb-ref setup-communicator
        communicator.set_up()
#+END_SRC

** Setup the Loop
   The loop will run continually until we run out of time. This sets up the time variables as well as a =last_index= variable that will make sure that we only print the value if it has been updated.

#+BEGIN_SRC ipython :session example3 :results none :noweb-ref setup-loop
        print("Receiving data...")
        #Process until we complete scan time
        last_index = 0
        start = datetime.now()
        total = timedelta(seconds=arguments.run_time)
        end = start + total
        
        if arguments.csv_data:
            print("index,frequency (MHz), amplitude (dBm)")
        while (datetime.now() < end):
#+END_SRC

** Process String
   As before, the thread needs to be prompted to inspect the string it has pulled from the serial port.

#+BEGIN_SRC ipython :session example3 :results none :noweb-ref process-string
            #Process all received data from device 
            rf_explorer.ProcessReceivedString(True)
#+END_SRC

** Print The Data
   This checks the =RFExplorer.RFECommunicator.SweepData.Count= to see if it is new data and then, if it is, Dumps the data to the screen. This is the only part that differs from example 1.
   
#+BEGIN_SRC ipython :session example3 :results none :noweb-ref print-data
            #Print data if received new sweep only
            if (rf_explorer.SweepData.Count > last_index):
                print(rf_explorer.SweepData.Dump())
                last_index = rf_explorer.SweepData.Count          
#+END_SRC

** End Main
   This is a leftover block to catch any exceptions that get raised.

#+BEGIN_SRC ipython :session example3 :results none :noweb-ref end-main    
    except Exception as error:
        print("Error: {}".format(error))
    return
#+END_SRC

* The Executable Block

#+BEGIN_SRC ipython :session example3 :results none :noweb-ref executable-block
if __name__ == "__main__":
    parser = argument_parser()
    arguments = parser.parse_args()

    with Communicator(arguments.serialport, arguments.baud_rate) as communicator:        
        main(arguments, communicator)
#+END_SRC

* Sample Output

#+BEGIN_SRC ipython :session example3 :results output
from example_1 import (
    argument_parser,
    Communicator,
)
from example_3 import main
parser = argument_parser()
arguments = parser.parse_args("--serialport /dev/ttyUSB0 --run-time 1".split())

with Communicator(arguments.serialport, arguments.baud_rate) as communicator:        
    main(arguments, communicator)
#+END_SRC

#+RESULTS:
#+begin_example
Detected COM ports:
  ,* /dev/ttyUSB0
/dev/ttyUSB0 is a valid available port.
RF Explorer Valid Ports found: 1 - /dev/ttyUSB0 
User COM port: /dev/ttyUSB0
Connected: /dev/ttyUSB0, 500000 bauds
Sending the Reset Command
Waiting until the device resets
Reset, sleeping for 3 seconds to let the device settle
requesting the RF Explorer configuration
Waiting for the model to not be None
Received RF Explorer device model info:#C2-M:004,255,01.11
New Freq range - buffer cleared.

RF Explorer 23-Apr-13 01.04.05 01.11
Model is set
Receiving data...
Sweep data: 2401.000 - MHz 0.643MHz  - Steps: 112
-99.5,-103.0,-101.5,-100.0,-101.5,-103.0,-101.5,-100.0,-100.0,-96.5,-98.5,-98.5,-101.0,-95.5,-99.0,-99.0,
-101.5,-102.5,-100.0,-100.0,-101.5,-96.0,-102.0,-99.0,-97.5,-100.0,-101.5,-99.5,-98.5,-101.0,-98.0,-101.0,
-98.5,-103.5,-98.5,-100.5,-99.5,-98.5,-99.5,-98.5,-101.0,-96.5,-97.5,-97.5,-98.5,-98.5,-102.0,-101.0,
-102.5,-101.5,-99.5,-97.0,-98.0,-97.5,-96.5,-100.0,-97.0,-101.5,-100.5,-95.0,-98.5,-99.5,-101.5,-99.0,
-101.5,-101.0,-100.0,-98.0,-98.0,-102.0,-98.0,-101.0,-97.0,-99.5,-99.5,-101.0,-96.5,-98.0,-100.0,-100.5,
-99.5,-97.5,-98.0,-102.0,-98.0,-95.5,-100.0,-97.5,-101.0,-98.5,-93.5,-102.5,-93.0,-102.0,-100.0,-98.0,
-99.5,-99.5,-98.0,-103.5,-99.5,-102.0,-99.0,-98.0,-94.5,-102.0,-97.0,-99.0,-101.5,-98.5,-101.5,-101.5
Sweep data: 2401.000 - MHz 0.643MHz  - Steps: 112
-101.5,-101.5,-98.5,-96.0,-99.5,-99.5,-101.0,-98.5,-98.0,-95.0,-99.0,-103.5,-101.5,-99.5,-101.0,-99.0,
-100.5,-100.5,-101.0,-97.5,-103.0,-99.0,-97.0,-98.5,-103.5,-96.0,-99.0,-97.0,-101.5,-98.5,-100.0,-101.5,
-98.5,-101.5,-98.5,-102.5,-101.5,-98.5,-99.0,-99.5,-101.5,-101.0,-103.0,-97.5,-96.0,-102.0,-98.5,-98.5,
-99.0,-97.5,-100.0,-98.0,-99.5,-99.5,-101.0,-99.0,-103.5,-99.5,-102.5,-99.0,-100.5,-100.0,-96.5,-100.5,
-99.5,-101.5,-101.0,-99.0,-100.0,-98.0,-101.5,-101.5,-99.0,-98.0,-101.5,-102.5,-97.5,-99.5,-99.0,-99.0,
-98.0,-103.0,-100.0,-98.0,-101.5,-100.5,-99.5,-101.5,-97.5,-98.0,-103.5,-103.0,-101.5,-100.5,-99.5,-99.5,
-101.5,-99.5,-101.0,-100.5,-98.0,-97.5,-100.0,-100.0,-96.5,-97.0,-101.0,-100.5,-100.0,-101.0,-100.5,-102.0
Sweep data: 2401.000 - MHz 0.643MHz  - Steps: 112
-98.5,-99.0,-100.0,-93.5,-95.5,-100.0,-99.0,-100.5,-99.5,-100.5,-95.0,-97.5,-101.0,-101.0,-98.5,-100.0,
-101.0,-100.5,-100.0,-98.0,-99.0,-104.5,-95.0,-102.5,-100.0,-98.5,-101.5,-98.5,-101.5,-98.0,-102.0,-100.0,
-101.0,-95.5,-98.0,-98.5,-98.0,-99.0,-101.0,-98.5,-104.0,-99.0,-98.5,-98.5,-96.5,-97.5,-100.5,-98.5,
-98.5,-103.0,-100.0,-99.5,-102.5,-98.0,-101.0,-100.0,-91.5,-97.5,-98.5,-102.0,-98.0,-101.0,-98.5,-96.5,
-100.0,-103.0,-101.0,-99.5,-103.0,-102.5,-99.0,-102.5,-99.5,-100.0,-97.5,-99.5,-96.0,-103.0,-100.0,-96.5,
-101.0,-100.5,-102.5,-103.0,-100.5,-103.0,-100.0,-101.0,-101.0,-102.0,-101.5,-101.0,-99.5,-99.0,-98.5,-97.0,
-102.0,-101.0,-101.0,-99.5,-100.0,-99.0,-99.5,-99.5,-101.0,-93.0,-97.0,-100.0,-100.0,-101.0,-99.5,-98.5
Received RF Explorer device model info:#C2-M:004,255,01.11
Sweep data: 2401.000 - MHz 0.643MHz  - Steps: 112
-96.5,-102.5,-100.5,-101.0,-95.0,-96.5,-98.0,-101.0,-101.0,-100.5,-99.5,-97.5,-98.0,-98.5,-101.5,-99.5,
-100.0,-96.0,-99.5,-98.0,-105.0,-98.0,-99.0,-99.0,-99.0,-100.0,-97.5,-97.0,-100.5,-99.5,-98.5,-101.5,
-103.0,-99.0,-99.0,-99.5,-101.5,-98.5,-95.0,-100.5,-99.0,-99.5,-104.5,-102.5,-100.0,-102.0,-102.0,-97.5,
-99.5,-98.5,-99.5,-98.5,-95.5,-98.0,-102.0,-100.5,-103.0,-96.5,-93.0,-100.5,-99.5,-101.0,-101.0,-103.0,
-93.5,-99.5,-91.5,-98.5,-99.0,-99.0,-104.0,-102.0,-95.5,-101.0,-95.5,-99.0,-98.5,-94.5,-100.5,-98.0,
-98.5,-102.5,-102.0,-97.0,-101.5,-99.0,-99.0,-98.5,-98.5,-98.0,-99.5,-96.0,-98.5,-97.5,-103.0,-100.5,
-102.0,-100.5,-95.0,-100.5,-99.5,-99.5,-97.0,-104.0,-98.5,-96.5,-104.0,-99.5,-100.5,-99.5,-101.0,-96.0
Sweep data: 2401.000 - MHz 0.643MHz  - Steps: 112
-101.5,-98.0,-106.0,-96.0,-98.5,-98.0,-99.0,-101.5,-100.5,-99.0,-99.5,-99.0,-98.0,-101.0,-101.0,-102.0,
-101.5,-102.0,-102.0,-100.0,-96.0,-98.5,-98.5,-104.0,-95.5,-100.0,-95.0,-97.0,-97.5,-100.0,-98.0,-98.5,
-101.5,-101.5,-97.5,-99.5,-101.5,-102.5,-98.0,-98.0,-97.5,-100.0,-100.0,-102.5,-99.5,-100.0,-98.0,-97.0,
-97.0,-100.0,-102.0,-101.5,-101.0,-96.5,-101.5,-96.5,-94.5,-101.0,-101.5,-98.0,-102.5,-99.0,-99.0,-101.0,
-99.0,-102.0,-99.5,-99.5,-96.5,-98.0,-99.5,-97.0,-100.5,-100.0,-101.0,-98.5,-100.0,-101.0,-99.0,-100.0,
-97.0,-96.0,-99.5,-100.0,-102.5,-101.5,-92.0,-100.0,-103.5,-101.0,-98.5,-97.0,-103.0,-102.0,-97.0,-103.5,
-97.0,-98.5,-93.0,-101.5,-98.0,-98.0,-98.0,-100.0,-99.5,-98.5,-98.0,-103.0,-103.0,-98.5,-99.0,-99.0
Sweep data: 2401.000 - MHz 0.643MHz  - Steps: 112
-98.5,-99.5,-104.0,-99.5,-97.5,-99.0,-101.5,-101.0,-100.0,-95.0,-100.5,-103.0,-101.0,-98.0,-99.5,-98.0,
-99.5,-100.0,-97.5,-97.0,-98.5,-95.0,-101.0,-98.0,-100.0,-99.5,-102.0,-100.0,-102.5,-98.0,-95.5,-101.0,
-100.5,-99.0,-98.5,-99.0,-99.0,-98.5,-99.0,-100.0,-98.5,-100.5,-99.0,-99.0,-101.5,-98.5,-101.0,-102.0,
-100.0,-100.5,-100.0,-98.5,-98.0,-98.0,-102.0,-98.0,-102.0,-100.0,-99.5,-101.5,-97.5,-99.0,-97.0,-100.5,
-100.0,-102.0,-101.5,-101.0,-101.0,-97.0,-101.5,-105.5,-105.0,-96.0,-96.5,-99.0,-99.0,-100.0,-99.0,-94.0,
-98.5,-99.0,-97.0,-98.0,-94.5,-92.0,-101.0,-98.0,-101.0,-99.5,-102.5,-98.5,-101.5,-98.5,-97.0,-101.5,
-98.0,-98.0,-99.0,-100.0,-99.5,-101.5,-100.5,-101.0,-101.5,-99.5,-101.5,-100.0,-94.5,-101.0,-97.0,-101.5
Sweep data: 2401.000 - MHz 0.643MHz  - Steps: 112
-102.0,-99.5,-100.0,-103.5,-101.5,-98.5,-100.0,-100.0,-98.5,-99.0,-101.5,-100.0,-99.5,-99.5,-100.0,-100.0,
-101.5,-95.5,-95.5,-102.0,-101.0,-100.5,-102.5,-100.5,-98.5,-98.0,-98.5,-94.0,-100.0,-98.5,-102.5,-102.0,
-88.0,-85.5,-85.5,-101.5,-99.0,-102.5,-100.0,-98.5,-102.5,-96.0,-98.0,-101.5,-96.5,-97.0,-98.0,-99.5,
-101.5,-98.0,-101.5,-100.5,-102.0,-97.0,-98.0,-101.0,-100.5,-96.0,-98.0,-99.5,-97.5,-99.5,-102.0,-98.5,
-99.5,-102.5,-100.0,-97.5,-101.0,-102.5,-100.5,-98.0,-98.5,-102.5,-97.0,-96.5,-99.0,-102.5,-98.0,-100.0,
-104.5,-102.5,-97.5,-102.5,-97.5,-101.0,-100.0,-95.0,-98.0,-101.5,-99.5,-97.0,-99.0,-98.0,-101.5,-100.5,
-98.5,-99.0,-101.0,-100.5,-99.5,-100.5,-99.0,-99.0,-99.5,-100.5,-93.5,-97.0,-96.0,-100.0,-101.0,-99.5
Disconnected.
#+end_example

So you can see that the RF Explorer breaks the frequencies up into 112 steps per sweep. The values seem really low, probably because my computers are all on 5 GHz, next time I should maybe run some traffic while this is running.
